nxp-mcuxpresso/mcux-sdk/devices/LPC54S018M/LPC54S018M.h
#define AES_STAT_REVERSE_MASK                    (0x10U)
#define AES_STAT_REVERSE_SHIFT                   (4U)
/*! REVERSE - Reverse mode.
 */
#define AES_STAT_REVERSE(x)                      (((uint32_t)(((uint32_t)(x)) << AES_STAT_REVERSE_SHIFT)) & AES_STAT_REVERSE_MASK)

#define AES_STAT_KEY_VALID_MASK                  (0x20U)
#define AES_STAT_KEY_VALID_SHIFT                 (5U)
/*! KEY_VALID - Key valid.
 */
#define AES_STAT_KEY_VALID(x)                    (((uint32_t)(((uint32_t)(x)) << AES_STAT_KEY_VALID_SHIFT)) & AES_STAT_KEY_VALID_MASK)
/*! @} */

/*! @name CTR_INCR - Counter Increment */
/*! @{ */

#define AES_CTR_INCR_CTR_INCR_MASK               (0xFFFFFFFFU)
#define AES_CTR_INCR_CTR_INCR_SHIFT              (0U)
/*! CTR_INCR - Increment value for HOLDING register when in counter modes.
 */
#define AES_CTR_INCR_CTR_INCR(x)                 (((uint32_t)(((uint32_t)(x)) << AES_CTR_INCR_CTR_INCR_SHIFT)) & AES_CTR_INCR_CTR_INCR_MASK)
/*! @} */

/*! @name KEY - Bits of the AES key */
/*! @{ */

#define AES_KEY_KEY_MASK                         (0xFFFFFFFFU)
#define AES_KEY_KEY_SHIFT                        (0U)
/*! KEY - Contains the bits of the AES key.
 */
#define AES_KEY_KEY(x)                           (((uint32_t)(((uint32_t)(x)) << AES_KEY_KEY_SHIFT)) & AES_KEY_KEY_MASK)
/*! @} */

/* The count of AES_KEY */
#define AES_KEY_COUNT                            (8U)

/*! @name INTEXT - Input text bits */
/*! @{ */

#define AES_INTEXT_INTEXT_MASK                   (0xFFFFFFFFU)
#define AES_INTEXT_INTEXT_SHIFT                  (0U)
/*! INTEXT - Contains bits of the AES key.
 */
#define AES_INTEXT_INTEXT(x)                     (((uint32_t)(((uint32_t)(x)) << AES_INTEXT_INTEXT_SHIFT)) & AES_INTEXT_INTEXT_MASK)
/*! @} */

/* The count of AES_INTEXT */
#define AES_INTEXT_COUNT                         (4U)

/*! @name HOLDING - Holding register bits */
/*! @{ */

#define AES_HOLDING_HOLDING_MASK                 (0xFFFFFFFFU)
#define AES_HOLDING_HOLDING_SHIFT                (0U)
/*! HOLDING - Contains the first word (bits 31:0) of the 128 bit Holding value.
 */
#define AES_HOLDING_HOLDING(x)                   (((uint32_t)(((uint32_t)(x)) << AES_HOLDING_HOLDING_SHIFT)) & AES_HOLDING_HOLDING_MASK)
/*! @} */

/* The count of AES_HOLDING */
#define AES_HOLDING_COUNT                        (4U)

/*! @name OUTTEXT - Output text bits */
/*! @{ */

#define AES_OUTTEXT_OUTTEXT_MASK                 (0xFFFFFFFFU)
#define AES_OUTTEXT_OUTTEXT_SHIFT                (0U)
/*! OUTTEXT - Contains the bits of the 128 bit Output text data.
 */
#define AES_OUTTEXT_OUTTEXT(x)                   (((uint32_t)(((uint32_t)(x)) << AES_OUTTEXT_OUTTEXT_SHIFT)) & AES_OUTTEXT_OUTTEXT_MASK)
/*! @} */

/* The count of AES_OUTTEXT */
#define AES_OUTTEXT_COUNT                        (4U)

/*! @name GF128_Y - Y bits input of GF128 hash */
/*! @{ */

#define AES_GF128_Y_GF128_Y_MASK                 (0xFFFFFFFFU)
#define AES_GF128_Y_GF128_Y_SHIFT                (0U)
/*! GF128_Y - Contains the bits of the Y input of GF128 hash.
 */
#define AES_GF128_Y_GF128_Y(x)                   (((uint32_t)(((uint32_t)(x)) << AES_GF128_Y_GF128_Y_SHIFT)) & AES_GF128_Y_GF128_Y_MASK)
/*! @} */

/* The count of AES_GF128_Y */
#define AES_GF128_Y_COUNT                        (4U)

/*! @name GF128_Z - Result bits of GF128 hash */
/*! @{ */

#define AES_GF128_Z_GF128_Z_MASK                 (0xFFFFFFFFU)
#define AES_GF128_Z_GF128_Z_SHIFT                (0U)
/*! GF128_Z - Contains bits of the result of GF128 hash.
 */
#define AES_GF128_Z_GF128_Z(x)                   (((uint32_t)(((uint32_t)(x)) << AES_GF128_Z_GF128_Z_SHIFT)) & AES_GF128_Z_GF128_Z_MASK)
/*! @} */

/* The count of AES_GF128_Z */
#define AES_GF128_Z_COUNT                        (4U)

/*! @name GCM_TAG - GCM Tag bits */
/*! @{ */

#define AES_GCM_TAG_GCM_TAG_MASK                 (0xFFFFFFFFU)
#define AES_GCM_TAG_GCM_TAG_SHIFT                (0U)
/*! GCM_TAG - Contains bits of the 128 bit GCM tag.
 */
#define AES_GCM_TAG_GCM_TAG(x)                   (((uint32_t)(((uint32_t)(x)) << AES_GCM_TAG_GCM_TAG_SHIFT)) & AES_GCM_TAG_GCM_TAG_MASK)
/*! @} */

/* The count of AES_GCM_TAG */
#define AES_GCM_TAG_COUNT                        (4U)


/*!
 * @}
 */ /* end of group AES_Register_Masks */


/* AES - Peripheral instance base addresses */
/** Peripheral AES0 base address */
#define AES0_BASE                                (0x400A1000u)
/** Peripheral AES0 base pointer */
#define AES0                                     ((AES_Type *)AES0_BASE)
/** Array initializer of AES peripheral base addresses */
#define AES_BASE_ADDRS                           { AES0_BASE }
/** Array initializer of AES peripheral base pointers */
#define AES_BASE_PTRS                            { AES0 }

/*!
 * @}
 */ /* end of group AES_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- ASYNC_SYSCON Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ASYNC_SYSCON_Peripheral_Access_Layer ASYNC_SYSCON Peripheral Access Layer
 * @{
 */

/** ASYNC_SYSCON - Register Layout Typedef */
typedef struct {
  __IO uint32_t ASYNCPRESETCTRL;                   /**< Async peripheral reset control, offset: 0x0 */
  __O  uint32_t ASYNCPRESETCTRLSET;                /**< Set bits in ASYNCPRESETCTRL, offset: 0x4 */
  __O  uint32_t ASYNCPRESETCTRLCLR;                /**< Clear bits in ASYNCPRESETCTRL, offset: 0x8 */
       uint8_t RESERVED_0[4];
  __IO uint32_t ASYNCAPBCLKCTRL;                   /**< Async peripheral clock control, offset: 0x10 */
  __O  uint32_t ASYNCAPBCLKCTRLSET;                /**< Set bits in ASYNCAPBCLKCTRL, offset: 0x14 */
  __O  uint32_t ASYNCAPBCLKCTRLCLR;                /**< Clear bits in ASYNCAPBCLKCTRL, offset: 0x18 */
       uint8_t RESERVED_1[4];
  __IO uint32_t ASYNCAPBCLKSELA;                   /**< Async APB clock source select A, offset: 0x20 */
} ASYNC_SYSCON_Type;

/* ----------------------------------------------------------------------------
   -- ASYNC_SYSCON Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ASYNC_SYSCON_Register_Masks ASYNC_SYSCON Register Masks
 * @{
 */

